Repository: hasanforaty/Profolio
Catalog: lib/l10n/app_*.arb
Languages: fa

# name
source: Hasan Foratyzade
fa: محمد حسن فراتی زاده

# aboutMe
source: I'm a passionate Developer I was an Accounting student until I realize that my skill and my interest weren't in Accounting but Creating an app and creating an infinite world of possibilities with my knowledge. I start learning how to code in 2020 May 21 with help of an old book about Java and a masterclass course then continue my journey with learning JSP and a little about spring. in 2020 December 21 I decided to change my route to mobile development and start learning Android with Kotlin then in 2022 July 5 I start learning Flutter and until now I dedicate my time and life to learn and use what I learn, and to learn and make myself better.
fa: من یک توسعه دهنده نرم افزار بااشتیاق هستم . در گذشته به عنوان یک حسابدار فعالیت داشته تاوقتی که متوجه شدم علاقه ای به حسابداری ندارم و علاقه من در ساخت اپ و جهانی بینهایت از احتمالات براساس دانشم است . یادگیری برنامه نویسی را به کمک کتابی قدیمی از برنامه نویسی java از ۱ خرداد ۱۳۹۹ شروع کردم و به وسیله یک کلاس آنلاین یادگیری خود را ادامه دادم سفر من به دنیای برنامه نویسی بااین ها پایان نیافت بعد از java به دنیای توسعه اپ های موبایل روی آوردم و با یادگیری kotlin شروع به فعالیت در حوضه android developer کردم. سپس در به دنیای flutter قدم گذاشته و تا کنون در حال فعالیت در این زمینه هستم.

# summery
source: hi, I'm a mobile developer with more than 2 year of experience in mobile development and maintaining legacy apps welcome to my online portfolio
fa: سلام من یک توسعه دهنده موبایل هستم با بیش از ۲ سال سابقه در توسعه موبایل اپلیکیشن ها و نگه داری اپ های لگسی . به پروفولیو آنلاین من خوش آمادید

# projectSummery
source: my main expertise is mobile developer and currently i'm working on a convenient litner box app cross different platforms
fa: تجربه کلی من در ضمینه اپ های موبایل است . من هم اکنون در حال ساخت یک اپ لایتنر باکس در پلتفورم های متفاوت هستم

# projectSummeryTitle
source: projects
fa: پروژه ها

# presenceProjectTitle
source: Project : Presence & Absence
fa: پروژه حضور و غیاب

# presenceProjectBody
source: a Flutter Project for supervisors in university to presence and absence
fa: پروژه ای جهت مدیریت حضور و غیاب اساتید دانشگاه توسط مدیران مربوطه

# portfolioSiteTitle
source: Project: Portfolio
fa: پروژه رزومه

# portfolioSiteBody
source: a Flutter web application to showcase my portfolio
fa: یک وب اپلیکیشن فلاتر جهت نمایش رزومه من

# shahreJahanProjectTitle
source: Project : Hotel Shahre jahan
fa: پروژه هتل شهر جهان

# shahreJahanProjectBody
source: a Flutter web application for hotel Shahrejahan
fa: یک وب اپلیکیشن برای هتل شهر جهان یزد

# momayeziTitle
source: Project : momayezi
fa: پروژه ممیزی

# momayeziBody
source: a project for organizations that want to create forms and collect data base on geography
fa: پروژه ای برای شرکت هایی که خواهان جمع آروی و ثبت اطلاعات بروروی نقشه هستند

# massSmsTitle
source: PROJECT : MASS SMS SENDER
fa: پروژه اپ ارسال اس ام اس

# massSmsBody
source: a project with solo perpuse of sending bulk of sms to group of people , it can be based periodically or one time send
fa: پروژه ای با هدف ارسال جمعی پیامک به گروهی از افراد چه به صورت دوره ای چه به صورت یک بار ارسال

source: Tech Stack:
fa: تکنولوژی :

# skillAndExperience
source: Skill & Experience
fa: مهارت ها و تجارب

# skillAndExperienceIntro
source: list of my Skill and Experience
fa: لیستی از مهات ها و تجارب من

# seeGitHub
source: see code base
fa: دیدن کد بیس

source: see final product
fa: دیدن محصول نهایی

# androidExTitle
source: Android app development
fa: توسعه نرم افزار اندوید

# androidExBody
source: I started my programming journey with android app development and spend 1/5 years working in different area of expertise from regular app to geography base apps.I describe my journey as one of most delightful time i had in programming
fa: من برنامه نویسی را از توسعه اندروید شروع کرده و به مدت یک سال و نیم در این ضمینه فعالیت داشته . این دوره یکی از بهترین دوره های توسعه نرم افزار برای من بوده .

# flutterExTitle
source: Flutter app development
fa: توسعه نرم افزار فلاتر

# flutterExBody
source: I start flutter as an hobby , to finding something new to learn but i get fascinate with it so here I'm working as a flutter developer
fa: من فلاتر رو به عنوان یک سرگرمی شروع کردم . ولی تا به خودم اومده بودم محو ساختار و زبانش شدم و حالا تا کنون در حال فعالیت در این زمینه هستم .
